# Расставьте знаки операций "плюс", "минус", "умножение" и скобки
# между числами "1 2 3 4 5" так, чтобы получилось число "25".
#
# Использовать нужно только указанные знаки операций, но не обязательно все перечисленные.
# Порядок чисел нужно сохранить.

# Пример для чисел "1 2 3" и "9"
result = (1 + 2) * 3
print(result)

# TODO написать формулу для 1 2 3 4 5 и вывести значение на консоль
# Нужно получить 25 из чисел 1 2 3 4 5 в том же порядке
result = 1 * (2 + 3) * 4 + 5   # = 1 * 5 * 4 + 5 = 25
print(result)